** Bagit

The amatica docs suggest that bagit files are a good why to create your
archives.  As a first pass we'll try that.  I am using [[https://github.com/little9/gladstone][gladstone]] to create these
bagit files.

#+BEGIN_SRC bash :results scalar
    bag='bagit-pets'
    gladstone --bagName ${bag} --originDirectory ex1-pets --cryptoMethod sha256 \
    --sourceOrganization "University of California, Davis Library - Special Collections" \
    --organizationAddress: '1 Shields Ave, Davis California 95616' \
    --contactName 'Special Collection' \
    --contactEmail 'library@ucdavis.edu' \
    --externalDescription 'Digital Management Collaborator Pets'
#+END_SRC

#+RESULTS:
: Creating bag directory: bagit-pets
: Creating data directory: /data
: Creating bag info file: bagit-pets/bag-info.txt
: Creating bag info file: bagit-pets/bagit.txt
: Creating manifest: bagit-pets/manifest-sha256.txt

Now we also want to add some  submission documentation

#+BEGIN_SRC bash
bag=bagit-pets
doc=${bag}/metadata/submissionDocumentation
# Amatica sez put in the metadata after the bag creation.
mkdir -p ${doc}
cp ex1-pets/thumbnail.png ${doc}

#+END_SRC

#+RESULTS:

** Creating metadata files

At a later date, we may be interested in creating metadata for more files than
just one, so the example below shows how we might do this based on our ttl
files. It's a bit painful the first time through, but otherwise works pretty well.

#+BEGIN_SRC bash :format raw
bag=bagit-pets
doc=${bag}/metadata/submissionDocumentation
sparql=~/apache-jena-3.9.0/bin/sparql

query="prefix : <http://schema.org/>
select ?filename ?dc_title ?dc_creator ?dc_date ?dc_publisher ?dc_subject ?dc_subject_2 ?dc_subject_3
WHERE {
 bind ('/objects' as ?filename) .
 ?c :name ?dc_title .
 ?c :creator ?dc_creator .
 ?c :keywords ?dc_subject .
 OPTIONAL { ?c :publisher ?dc_publisher . }
 OPTIONAL { ?c :datePublished ?dc_date}
 OPTIONAL { ?c :keywords ?dc_subject_2 . filter(?dc_subject != ?dc_subject_2) . }
 OPTIONAL { ?c :keywords ?dc_subject_3 .
            filter(?dc_subject != ?dc_subject_3) .
            filter(?dc_subject_2 != ?dc_subject_3)
  }
}
LIMIT 1"
${sparql} --data=ex1-pets.ttl --results=csv --query=- <<<$query |
 sed -e 's/dc_/dc./g' -e 's/_[0-9]//g' > ${bag}/metadata/metadata.csv
cat ${bag}/metadata/metadata.csv
#+END_SRC

#+RESULTS:
| filename | dc.title          | dc.creator | dc.date | dc.publisher | dc.subject | dc.subject | dc.subject |
| /objects | Collaborator Pets | Quinn Hart |    2018 |              | Cats       | Dogs       | Pets       |


